## Setup

In [1]:
%load_ext sql

In [3]:
# Connect to sakila MySQL database
%sql mysql+mysqlconnector://root:Harvard1972@iliarudiak-macbook.local:3306/sakila

In [6]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## 01 What Is a Subquery?

In [9]:
%%sql
SELECT MAX(customer_id) FROM customer;

 * mysql+mysqlconnector://root:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[(599,)]

In [10]:
%%sql
SELECT customer_id, first_name, last_name
FROM customer
WHERE customer_id = 599;

 * mysql+mysqlconnector://root:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[(599, 'AUSTIN', 'CINTRON')]

In [7]:
%%sql
SELECT customer_id, first_name, last_name
FROM customer
WHERE customer_id = (SELECT MAX(customer_id) FROM customer);

 * mysql+mysqlconnector://root:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[(599, 'AUSTIN', 'CINTRON')]

## 02 Subquery Types

### 01 Noncorrelated Subqueries

#### 01 Scalar subquery

In [13]:
%%sql
-- Find id for India
SELECT country_id 
FROM country 
WHERE country = 'India';

 * mysql+mysqlconnector://root:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[(44,)]

In [12]:
%%sql
-- Find all cities in India using code for India 44
SELECT city_id, city 
FROM city 
WHERE country_id = 44
LIMIT 5;

 * mysql+mysqlconnector://root:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(8, 'Adoni'),
 (9, 'Ahmadnagar'),
 (18, 'Allappuzha (Alleppey)'),
 (22, 'Ambattur'),
 (24, 'Amroha')]

In [14]:
%%sql
-- Find all cities in India using a subquery
SELECT city_id, city
FROM city
WHERE country_id = (SELECT country_id FROM country WHERE country = 'India')
LIMIT 5;

 * mysql+mysqlconnector://root:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(8, 'Adoni'),
 (9, 'Ahmadnagar'),
 (18, 'Allappuzha (Alleppey)'),
 (22, 'Ambattur'),
 (24, 'Amroha')]

In [16]:
%%sql
-- Count cities in India using subquery
SELECT COUNT(*) 
FROM city 
WHERE country_id = (SELECT country_id FROM country WHERE country = 'India');

 * mysql+mysqlconnector://root:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[(60,)]